package com.tms;

//**Дано целое число.
//Найти количество положительных чисел в исходном наборе.**


public class HomeWorkTask4 {
    public static void main( String[] args ){
        int a=5;
        int b=4;
        int c=44;
        if ( a > 0 & b > 0 & c > 0) {
            System.out.println("В исходном наборе три положительных числа");
        }
    }
    }
